app/controllers/greetings_controller.rb

SELECT "greetings".* FROM "greetings"
---
    def index
        @greetings = Greeting.all.sample